node {
  name: "face_model/input_node"
  op: "Placeholder"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 224
        }
        dim {
          size: 224
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "Conv1_pad/Pad/paddings"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "Conv1_pad/Pad"
  op: "Pad"
  input: "face_model/input_node"
  input: "Conv1_pad/Pad/paddings"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "Conv1/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "Conv1/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.1380131095647812
      }
    }
  }
}
node {
  name: "Conv1/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.1380131095647812
      }
    }
  }
}
node {
  name: "Conv1/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "Conv1/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "Conv1/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "Conv1/kernel/Initializer/random_uniform/max"
  input: "Conv1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/kernel"
      }
    }
  }
}
node {
  name: "Conv1/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "Conv1/kernel/Initializer/random_uniform/RandomUniform"
  input: "Conv1/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/kernel"
      }
    }
  }
}
node {
  name: "Conv1/kernel/Initializer/random_uniform"
  op: "Add"
  input: "Conv1/kernel/Initializer/random_uniform/mul"
  input: "Conv1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/kernel"
      }
    }
  }
}
node {
  name: "Conv1/kernel"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "Conv1/kernel"
    }
  }
}
node {
  name: "Conv1/kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "Conv1/kernel"
  device: "/device:GPU:0"
}
node {
  name: "Conv1/kernel/Assign"
  op: "AssignVariableOp"
  input: "Conv1/kernel"
  input: "Conv1/kernel/Initializer/random_uniform"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Conv1/kernel"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/dilation_rate"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "Conv1/Conv2D/ReadVariableOp"
  op: "ReadVariableOp"
  input: "Conv1/kernel"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1/Conv2D"
  op: "Conv2D"
  input: "Conv1_pad/Pad"
  input: "Conv1/Conv2D/ReadVariableOp"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "bn_Conv1/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn_Conv1/gamma"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn_Conv1/gamma"
    }
  }
}
node {
  name: "bn_Conv1/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "bn_Conv1/gamma"
  device: "/device:GPU:0"
}
node {
  name: "bn_Conv1/gamma/Assign"
  op: "AssignVariableOp"
  input: "bn_Conv1/gamma"
  input: "bn_Conv1/gamma/Initializer/ones"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn_Conv1/gamma"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn_Conv1/beta"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn_Conv1/beta"
    }
  }
}
node {
  name: "bn_Conv1/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "bn_Conv1/beta"
  device: "/device:GPU:0"
}
node {
  name: "bn_Conv1/beta/Assign"
  op: "AssignVariableOp"
  input: "bn_Conv1/beta"
  input: "bn_Conv1/beta/Initializer/zeros"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn_Conv1/beta"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "bn_Conv1/moving_mean"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn_Conv1/moving_mean"
    }
  }
}
node {
  name: "bn_Conv1/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "bn_Conv1/moving_mean"
  device: "/device:GPU:0"
}
node {
  name: "bn_Conv1/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "bn_Conv1/moving_mean"
  input: "bn_Conv1/moving_mean/Initializer/zeros"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn_Conv1/moving_mean"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn_Conv1/moving_variance"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "bn_Conv1/moving_variance"
    }
  }
}
node {
  name: "bn_Conv1/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "bn_Conv1/moving_variance"
  device: "/device:GPU:0"
}
node {
  name: "bn_Conv1/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "bn_Conv1/moving_variance"
  input: "bn_Conv1/moving_variance/Initializer/ones"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn_Conv1/moving_variance"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "keras_learning_phase/input"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "keras_learning_phase"
  op: "PlaceholderWithDefault"
  input: "keras_learning_phase/input"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "bn_Conv1/cond/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_Conv1/cond/switch_t"
  op: "Identity"
  input: "bn_Conv1/cond/Switch:1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_Conv1/cond/switch_f"
  op: "Identity"
  input: "bn_Conv1/cond/Switch"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_Conv1/cond/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_Conv1/cond/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn_Conv1/cond/ReadVariableOp/Switch:1"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/cond/ReadVariableOp/Switch"
  op: "Switch"
  input: "bn_Conv1/gamma"
  input: "bn_Conv1/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/gamma"
      }
    }
  }
}
node {
  name: "bn_Conv1/cond/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "bn_Conv1/cond/ReadVariableOp_1/Switch:1"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/cond/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "bn_Conv1/beta"
  input: "bn_Conv1/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/beta"
      }
    }
  }
}
node {
  name: "bn_Conv1/cond/Const"
  op: "Const"
  input: "^bn_Conv1/cond/switch_t"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "bn_Conv1/cond/Const_1"
  op: "Const"
  input: "^bn_Conv1/cond/switch_t"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "bn_Conv1/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "bn_Conv1/cond/FusedBatchNormV3/Switch:1"
  input: "bn_Conv1/cond/ReadVariableOp"
  input: "bn_Conv1/cond/ReadVariableOp_1"
  input: "bn_Conv1/cond/Const"
  input: "bn_Conv1/cond/Const_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "bn_Conv1/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "Conv1/Conv2D"
  input: "bn_Conv1/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/Conv2D"
      }
    }
  }
}
node {
  name: "bn_Conv1/cond/ReadVariableOp_2"
  op: "ReadVariableOp"
  input: "bn_Conv1/cond/ReadVariableOp_2/Switch"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/cond/ReadVariableOp_2/Switch"
  op: "Switch"
  input: "bn_Conv1/gamma"
  input: "bn_Conv1/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/gamma"
      }
    }
  }
}
node {
  name: "bn_Conv1/cond/ReadVariableOp_3"
  op: "ReadVariableOp"
  input: "bn_Conv1/cond/ReadVariableOp_3/Switch"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/cond/ReadVariableOp_3/Switch"
  op: "Switch"
  input: "bn_Conv1/beta"
  input: "bn_Conv1/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/beta"
      }
    }
  }
}
node {
  name: "bn_Conv1/cond/FusedBatchNormV3_1/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn_Conv1/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  op: "Switch"
  input: "bn_Conv1/moving_mean"
  input: "bn_Conv1/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_mean"
      }
    }
  }
}
node {
  name: "bn_Conv1/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "bn_Conv1/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "bn_Conv1/moving_variance"
  input: "bn_Conv1/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_variance"
      }
    }
  }
}
node {
  name: "bn_Conv1/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "bn_Conv1/cond/FusedBatchNormV3_1/Switch"
  input: "bn_Conv1/cond/ReadVariableOp_2"
  input: "bn_Conv1/cond/ReadVariableOp_3"
  input: "bn_Conv1/cond/FusedBatchNormV3_1/ReadVariableOp"
  input: "bn_Conv1/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "bn_Conv1/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "Conv1/Conv2D"
  input: "bn_Conv1/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Conv1/Conv2D"
      }
    }
  }
}
node {
  name: "bn_Conv1/cond/Merge"
  op: "Merge"
  input: "bn_Conv1/cond/FusedBatchNormV3_1"
  input: "bn_Conv1/cond/FusedBatchNormV3"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/cond/Merge_1"
  op: "Merge"
  input: "bn_Conv1/cond/FusedBatchNormV3_1:1"
  input: "bn_Conv1/cond/FusedBatchNormV3:1"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/cond/Merge_2"
  op: "Merge"
  input: "bn_Conv1/cond/FusedBatchNormV3_1:2"
  input: "bn_Conv1/cond/FusedBatchNormV3:2"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/cond_1/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_Conv1/cond_1/switch_t"
  op: "Identity"
  input: "bn_Conv1/cond_1/Switch:1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_Conv1/cond_1/switch_f"
  op: "Identity"
  input: "bn_Conv1/cond_1/Switch"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_Conv1/cond_1/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "bn_Conv1/cond_1/Const"
  op: "Const"
  input: "^bn_Conv1/cond_1/switch_t"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.9990000128746033
      }
    }
  }
}
node {
  name: "bn_Conv1/cond_1/Const_1"
  op: "Const"
  input: "^bn_Conv1/cond_1/switch_f"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn_Conv1/cond_1/Merge"
  op: "Merge"
  input: "bn_Conv1/cond_1/Const_1"
  input: "bn_Conv1/cond_1/Const"
  device: "/device:GPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg/sub/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg/sub"
  op: "Sub"
  input: "bn_Conv1/AssignMovingAvg/sub/x"
  input: "bn_Conv1/cond_1/Merge"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_mean"
      }
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn_Conv1/moving_mean"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg/sub_1"
  op: "Sub"
  input: "bn_Conv1/AssignMovingAvg/ReadVariableOp"
  input: "bn_Conv1/cond/Merge_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_mean"
      }
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg/mul"
  op: "Mul"
  input: "bn_Conv1/AssignMovingAvg/sub_1"
  input: "bn_Conv1/AssignMovingAvg/sub"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_mean"
      }
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg/AssignSubVariableOp"
  op: "AssignSubVariableOp"
  input: "bn_Conv1/moving_mean"
  input: "bn_Conv1/AssignMovingAvg/mul"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "bn_Conv1/moving_mean"
  input: "^bn_Conv1/AssignMovingAvg/AssignSubVariableOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg_1/sub/x"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "bn_Conv1/AssignMovingAvg_1/sub/x"
  input: "bn_Conv1/cond_1/Merge"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_variance"
      }
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg_1/ReadVariableOp"
  op: "ReadVariableOp"
  input: "bn_Conv1/moving_variance"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg_1/sub_1"
  op: "Sub"
  input: "bn_Conv1/AssignMovingAvg_1/ReadVariableOp"
  input: "bn_Conv1/cond/Merge_2"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_variance"
      }
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "bn_Conv1/AssignMovingAvg_1/sub_1"
  input: "bn_Conv1/AssignMovingAvg_1/sub"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_variance"
      }
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg_1/AssignSubVariableOp"
  op: "AssignSubVariableOp"
  input: "bn_Conv1/moving_variance"
  input: "bn_Conv1/AssignMovingAvg_1/mul"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "bn_Conv1/AssignMovingAvg_1/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "bn_Conv1/moving_variance"
  input: "^bn_Conv1/AssignMovingAvg_1/AssignSubVariableOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@bn_Conv1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "Conv1_relu/Relu6"
  op: "Relu6"
  input: "bn_Conv1/cond/Merge"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise/depthwise_kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise/depthwise_kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.14213381707668304
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise/depthwise_kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.14213381707668304
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise/depthwise_kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/max"
  input: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise/depthwise_kernel"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/RandomUniform"
  input: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise/depthwise_kernel"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform"
  op: "Add"
  input: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/mul"
  input: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise/depthwise_kernel"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise_kernel"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise/depthwise_kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 32
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "expanded_conv_depthwise/depthwise_kernel"
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise_kernel/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "expanded_conv_depthwise/depthwise_kernel"
  device: "/device:GPU:0"
}
node {
  name: "expanded_conv_depthwise/depthwise_kernel/Assign"
  op: "AssignVariableOp"
  input: "expanded_conv_depthwise/depthwise_kernel"
  input: "expanded_conv_depthwise/depthwise_kernel/Initializer/random_uniform"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise_kernel/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise/depthwise_kernel"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise/ReadVariableOp"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise/depthwise_kernel"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise/Shape"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000 \000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise/dilation_rate"
  op: "Const"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "Conv1_relu/Relu6"
  input: "expanded_conv_depthwise/depthwise/ReadVariableOp"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/gamma"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "expanded_conv_depthwise_BN/gamma"
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/gamma/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "expanded_conv_depthwise_BN/gamma"
  device: "/device:GPU:0"
}
node {
  name: "expanded_conv_depthwise_BN/gamma/Assign"
  op: "AssignVariableOp"
  input: "expanded_conv_depthwise_BN/gamma"
  input: "expanded_conv_depthwise_BN/gamma/Initializer/ones"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/gamma/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise_BN/gamma"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/beta"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "expanded_conv_depthwise_BN/beta"
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/beta/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "expanded_conv_depthwise_BN/beta"
  device: "/device:GPU:0"
}
node {
  name: "expanded_conv_depthwise_BN/beta/Assign"
  op: "AssignVariableOp"
  input: "expanded_conv_depthwise_BN/beta"
  input: "expanded_conv_depthwise_BN/beta/Initializer/zeros"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/beta/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise_BN/beta"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/moving_mean"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "expanded_conv_depthwise_BN/moving_mean"
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/moving_mean/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "expanded_conv_depthwise_BN/moving_mean"
  device: "/device:GPU:0"
}
node {
  name: "expanded_conv_depthwise_BN/moving_mean/Assign"
  op: "AssignVariableOp"
  input: "expanded_conv_depthwise_BN/moving_mean"
  input: "expanded_conv_depthwise_BN/moving_mean/Initializer/zeros"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/moving_mean/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise_BN/moving_mean"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/moving_variance"
  op: "VarHandleOp"
  device: "/device:GPU:0"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "expanded_conv_depthwise_BN/moving_variance"
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/moving_variance/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "expanded_conv_depthwise_BN/moving_variance"
  device: "/device:GPU:0"
}
node {
  name: "expanded_conv_depthwise_BN/moving_variance/Assign"
  op: "AssignVariableOp"
  input: "expanded_conv_depthwise_BN/moving_variance"
  input: "expanded_conv_depthwise_BN/moving_variance/Initializer/ones"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/moving_variance/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise_BN/moving_variance"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/Switch"
  op: "Switch"
  input: "keras_learning_phase"
  input: "keras_learning_phase"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/switch_t"
  op: "Identity"
  input: "expanded_conv_depthwise_BN/cond/Switch:1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/switch_f"
  op: "Identity"
  input: "expanded_conv_depthwise_BN/cond/Switch"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/pred_id"
  op: "Identity"
  input: "keras_learning_phase"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/ReadVariableOp"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise_BN/cond/ReadVariableOp/Switch:1"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/ReadVariableOp/Switch"
  op: "Switch"
  input: "expanded_conv_depthwise_BN/gamma"
  input: "expanded_conv_depthwise_BN/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/gamma"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise_BN/cond/ReadVariableOp_1/Switch:1"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "expanded_conv_depthwise_BN/beta"
  input: "expanded_conv_depthwise_BN/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/beta"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/Const"
  op: "Const"
  input: "^expanded_conv_depthwise_BN/cond/switch_t"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/Const_1"
  op: "Const"
  input: "^expanded_conv_depthwise_BN/cond/switch_t"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3/Switch:1"
  input: "expanded_conv_depthwise_BN/cond/ReadVariableOp"
  input: "expanded_conv_depthwise_BN/cond/ReadVariableOp_1"
  input: "expanded_conv_depthwise_BN/cond/Const"
  input: "expanded_conv_depthwise_BN/cond/Const_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3/Switch"
  op: "Switch"
  input: "expanded_conv_depthwise/depthwise"
  input: "expanded_conv_depthwise_BN/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise/depthwise"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/ReadVariableOp_2"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise_BN/cond/ReadVariableOp_2/Switch"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/ReadVariableOp_2/Switch"
  op: "Switch"
  input: "expanded_conv_depthwise_BN/gamma"
  input: "expanded_conv_depthwise_BN/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/gamma"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/ReadVariableOp_3"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise_BN/cond/ReadVariableOp_3/Switch"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/ReadVariableOp_3/Switch"
  op: "Switch"
  input: "expanded_conv_depthwise_BN/beta"
  input: "expanded_conv_depthwise_BN/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/beta"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1/ReadVariableOp"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1/ReadVariableOp/Switch"
  op: "Switch"
  input: "expanded_conv_depthwise_BN/moving_mean"
  input: "expanded_conv_depthwise_BN/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/moving_mean"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  op: "ReadVariableOp"
  input: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  device: "/device:GPU:0"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1/ReadVariableOp_1/Switch"
  op: "Switch"
  input: "expanded_conv_depthwise_BN/moving_variance"
  input: "expanded_conv_depthwise_BN/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_RESOURCE
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise_BN/moving_variance"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1"
  op: "FusedBatchNormV3"
  input: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1/Switch"
  input: "expanded_conv_depthwise_BN/cond/ReadVariableOp_2"
  input: "expanded_conv_depthwise_BN/cond/ReadVariableOp_3"
  input: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1/ReadVariableOp"
  input: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1/ReadVariableOp_1"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1/Switch"
  op: "Switch"
  input: "expanded_conv_depthwise/depthwise"
  input: "expanded_conv_depthwise_BN/cond/pred_id"
  device: "/device:GPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@expanded_conv_depthwise/depthwise"
      }
    }
  }
}
node {
  name: "expanded_conv_depthwise_BN/cond/Merge"
  op: "Merge"
  input: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3_1"
  input: "expanded_conv_depthwise_BN/cond/FusedBatchNormV3"
  device: "/device:GPU:0"
